<template>
  <div class="flex flex-col gap-5">
    <p
      v-for="(item, i) in text"
      :key="i"
      class="xl:w-[650px] lg:w-[600px] md:w-[500px] text-xl text-primary font-medium"
    >
      {{ item }}
    </p>
  </div>
</template>

<script setup>
const text = [
  `Интернет-магазин NORNLIGHT предлагает широкий ассортимент светильников для
освещения вашего дома или офиса. У нас вы найдете разнообразные модели
светильников, от современных и стильных до классических и элегантных. Мы
предлагаем качественные и надежные светильники от лучших производителей, которые
подарят вам комфорт и уют.`,
  `Покупая светильники в нашем интернет-магазине, вы
получаете отличное соотношение цены и качества. Мы осуществляем доставку по всей
России, чтобы каждый клиент мог насладиться прекрасным светом и удобством
покупки онлайн. Обратитесь к нам сегодня и превратите ваш дом в оазис тепла и
света с NORNLIGHT!`,
  `Интернет-магазин NORNLIGHT предлагает широкий ассортимент
светильников для освещения вашего дома или офиса. У нас вы найдете разнообразные
модели светильников, от современных и стильных до классических и элегантных. Мы
предлагаем качественные и надежные светильники от лучших производителей, которые
подарят вам комфорт и уют.`,
  `Покупая светильники в нашем интернет-магазине, вы получаете отличное
соотношение цены и качества. Мы осуществляем доставку по всей России, чтобы
каждый клиент мог насладиться прекрасным светом и удобством покупки онлайн.
Обратитесь к нам сегодня и превратите ваш дом в оазис тепла и света с NORNLIGHT!`,
];
</script>
