<template>
  <div class="container">
    <div class="flex justify-between lg:flex-nowrap flex-wrap">
      <p class="lg:text-6xl sm:text-5xl text-4xl font-bold text-primary">
        Возврат
      </p>
      <div class="flex flex-col gap-6">
        <p class="text-2xl font-semibold text-black">
          Обмен и возврат по желанию покупателя
        </p>
        <p class="md:w-[640px] md:text-xl text-sm">
          Если товар по каким-то причинам не подошел вам, вы имеете право
          вернуть его или обменять на другой в течение 7 дней* с момента покупки
          при соблюдении следующих условий:
        </p>

        <li
          class="md:w-[640px] xl:text-xl md:text-lg sm:text-sm text-xs text-[#2F4DA3]"
          v-for="(item, i) in data"
          :key="i"
        >
          {{ item }}
        </li>

        <p class="lg:text-2xl md:text-xl text-base font-semibold text-black">
          Обмен и возврат по ошибке продавца
        </p>
        <p class="md:w-[640px] md:text-xl text-sm">
          Причины обмена или возврата по ошибке продавца:
        </p>

        <li
          class="md:w-[640px] md:text-xl sm:text-sm text-xs text-[#2F4DA3]"
          v-for="(item, i) in data2"
          :key="i"
        >
          {{ item }}
        </li>

        <p class="lg:text-2xl md:text-xl text-base font-semibold text-black">
          Возврат денежных средств
        </p>
        <p class="md:w-[640px] md:text-xl text-sm">
          Возврат денежных средств осуществляется путем перевода на банковские
          реквизиты покупателя при наличии заявления от покупателя.
        </p>
      </div>
    </div>
  </div>
</template>

<script setup>
const data = [
  `
Товар имеет первоначальный вид, имеется товарная кондиция;

`,

  `Товар имеет полную
комплектацию, включая упаковочные материалы;`,
  `Товар не имеет следов подключался и
не имеет признаков монтажа;`,
  `Упаковка товара не имеет повреждений, присутствует
первоначальный товарный вид;`,
  ` Есть документ, подтверждающий покупку в нашем
интернет-магазине.`,
  `
Для возврата товара необходимо привезти его к нам в офис.
Товар из других городов можно прислать нам транспортной компанией, при этом
услуги транспортной компании  оплачиваются клиентом. `,
  `*В течение 14 дней для
отдельных брендов. При оформлении заказа уточните у менеджера`,
];

const data2 = [
  `Неполная комплектация товара`,
  `Брак или дефект товара`,
  `Если вы выявили дефект, брак или неполную комплектацию товара, необходимо сделать фото дефекта и отправить на почту mail@at-svet.ru, указав краткое описание характера брака/
`,
  `Мы заменим бракованный товар или довезем недостающие части. Доставка будет осуществлена бесплатно`,
];
</script>
